let fakindeksoj =`{AGR}-🚜-agrokulturo-เกษตรกรรม
{ARKE}-🏺-arkeologio-โบราณคดี
{ARKI}-🏛️-arkitekturo-สถาปัตยกรรม
{AST}-🔭-astronomio-ดาราศาสตร์
{AUT}-🚗-aŭtomobiloj-ยานพาหนะ
{AVI}-🛩️-aviado-การบิน
{BAK}-🦠-bakteriologio, virusologio-แบคทีเรียวิทยา, ไวรัสวิทยา
{BELA}-🎨-belartoj-วิจิตรศิลป์
{BELE}-🗞️-beletro-วรรณวิจิตร
{BIB}-📖-biblio-พระคริสต์ธรรมคำภีร์
{BIO}-🔬-biologio, biontologio-ชีววิทยา
{BOT}-🌳-botaniko-พฤกษศาสตร์
{BUD}-☸-budhismo-พุทธศาสนา
{EKOL}-♻️-ekologio-นิเวศวิทยา
{EKON}-💸-ekonomiko, financo, komerco-เศรษฐศาสตร์, การเงิน, การค้า
{ELE}-⚡-elektro-ไฟฟ้า
{ELET}-🔌-elektrotekniko-อิเล็กทรอนิกส์
{ESP}-💚-esperantismo-เอสเปรันโตนิยม
{FER}-🚂-fervojoj-รถไฟ
{FIL}-☯️-filozofio-ปรัชญา
{FIZ}-🧲-fiziko-ฟิสิกส์
{FIZL}-🫀-fiziologio-สรีรวิทยา
{FON}-🗣️-fonetiko-สัทศาสตร์
{FOT}-📸-fotografio, optiko-การถ่ายภาพ, ทัศนศาสตร์
{GEN}-👪-genealogio-ลำดับเครือญาติ
{GEOD}-🗺️-geodezio, topografio-ภูมิมาตรศาสตร์, การแผนที่
{GEOG}-🏔️-geografio-ภูมิศาสตร์
{GEOL}-🌋-geologio-ธรณีวิทยา
{GRA}-🔤-gramatiko-ไวยากรณ์
{HER}-📐-heraldiko-มุทราศาสตร์ (การออกแบบ)
{HIN}-🛕-hinduismo-ศาสนาฮินดู
{HIS}-🏹-historio-ประวัติศาสตร์
{ANA}-🦵-homa anatomio, histologio-กายวิภาคศาสตร์, มิญชวิทยา
{HOR}-🌷-hortikulturo, arbokulturo, silvikulturo-พืชกรรมสวน (วิชาพืชสวน)
{ISL}-☪️-islamo-อิสลาม
{JUR}-⚖️-juro-กฎหมาย
{KAL}-📆-kalendaro, tempomezurado-ปฏิทิน, หน่วยเวลา
{KAT}-⛪-katolikismo-คาทอลิก
{KEM}-⚗️-kemio, biokemio-เคมี, ไบโอเคมี
{KIN}-🎞️-kinoarto-ภาพยนตร์
{KIR}-✂️-kirurgio-ศัลยกรรม
{KOMP}-🖥️-komputiko-คอมพิวเตอร์
{KON}-🔨-konstrutekniko-การก่อสร้าง
{KRI}-✝-kristanismo-ศาสนาคริสต์
{KUI}-🔪-kuirarto-อาหาร
{LIN}-💬-lingvistiko, filologio-ภาษาศาสตร์, นิรุกติศาสตร์
{MAR}-⚓-maraferoj-ทะเล
{MAS}-⏱️-maŝinoj, mekaniko-เครื่องกล
{MAT}-🧮-matematiko-คณิตศาสตร์
{MAH}--materialismo historia-วัตถุนิยมประวัติศาสตร์
{MED}-⚕️-medicino, farmacio-แพทยศาสตร์, เภสัชศาสตร์
{MET}-🌥️-meteologio-สภาพอากาศ
{MIL}-🪖-militaferoj-สงคราม
{MIN}-⛏️-mineralogio-แร่วิทยา
{MIT}-🧝‍♂️-mitologio-ปรัมปราวิทยา
{MUZ}-🎶-muziko-ดนตรี
{NOM}-👥-nomoj-ชื่อ
{PAL}-🦖-paleontologio-บรรพชีวินวิทยา
{PED}-🏫-pedagogio-การศึกษา
{PERS}-🧍-personoj-คน
{POE}-🪶-poetiko, poezio-กวี
{POL}-🗳️-politiko, sociologio, administrado-การเมือง, สังคมศาสตร์, การบริหารจัดการ
{POSX}-📨-poŝto-ไปรษณีย์
{PRA}-🦣-prahistorio-ก่อนประวัติศาสาตร์
{TIP}-📚-presarto, libroj-การพิมพ์
{PSI}-🧠-psikologio, psikiatrio-จิตวิทยา
{RAD}-📻-radiofonio-วิทยุ
{REL}-🪷-religioj-ศาสนา
{RET}-📶-retoj, Interreto-เครือข่าย, อินเตอร์เน็ต
{SCI}-⚛️-sciencoj-วิทยาศาสตร์
{SHI}-⛵-ŝipkonstruado, navigado-เรือ, การเดินเรือ
{SPO}-🚵-sporto, ludoj-กีฬา
{TEA}-🎭-teatro-การละคร
{TEK}-🪛-teknikoj-เทคนิค
{TEKS}-🧣-teksindustrio, vestoj-เสื้อผ้า
{TEL}-📞-telekomunikoj-การสื่อสาร
{TRA}-🚦-trafiko-การจราจร
{ZOO}-🦭-zoologio-สัตววิทยา
{THA}-🇹🇭-tajlandaj aferoj-คำศัพท์ที่เกี่ยวกับประเทศไทย`

const fakindeksoj_ARR = fakindeksoj.split("\n").map(line => line.split('-').map(part => part.trim()));

const fakindeksoj_ARR_2 = fakindeksoj_ARR.map(item => [item[0], item[1]]);
console.log(fakindeksoj_ARR_2);